## Staging: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 9 to add, 0 to change, 9 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                             NAME                              |
|----------|---------------------------------------------------------------|
| recreate | `aws_route53_record.bounce-custom-notification-sandbox-MX[0]` |
|          | `aws_route53_record.bounce-notification-sandbox-MX[0]`        |
|          | `aws_route53_record.bounce-notification-sandbox-TXT[0]`       |
|          | `aws_route53_record.custom-domain-aws-ses-sandbox-TXT[0]`     |
|          | `aws_route53_record.custom-domain-ses-sandbox-TXT[0]`         |
|          | `aws_route53_record.dmarc-notification-sandbox-TXT[0]`        |
|          | `aws_route53_record.notification-sandbox-MX[0]`               |
|          | `aws_route53_record.notification-sandbox-TXT[0]`              |
|          | `aws_route53_record.ses-notification-sandbox-TXT[0]`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.bounce-custom-notification-sandbox-MX[0] must be replaced
-/+ resource "aws_route53_record" "bounce-custom-notification-sandbox-MX" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_bounce.custom-sending-domain.staging.notification.cdssandbox.xyz_MX" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "bounce.custom-sending-domain.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.bounce-notification-sandbox-MX[0] must be replaced
-/+ resource "aws_route53_record" "bounce-notification-sandbox-MX" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "bounce.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_bounce.staging.notification.cdssandbox.xyz_MX" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "bounce.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.bounce-notification-sandbox-TXT[0] must be replaced
-/+ resource "aws_route53_record" "bounce-notification-sandbox-TXT" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "bounce.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_bounce.staging.notification.cdssandbox.xyz_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "bounce.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.custom-domain-aws-ses-sandbox-TXT[0] must be replaced
-/+ resource "aws_route53_record" "custom-domain-aws-ses-sandbox-TXT" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_amazonses.custom-sending-domain.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.custom-domain-ses-sandbox-TXT[0] must be replaced
-/+ resource "aws_route53_record" "custom-domain-ses-sandbox-TXT" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "custom-sending-domain.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_custom-sending-domain.staging.notification.cdssandbox.xyz_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "custom-sending-domain.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.dmarc-notification-sandbox-TXT[0] must be replaced
-/+ resource "aws_route53_record" "dmarc-notification-sandbox-TXT" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_dmarc.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__dmarc.staging.notification.cdssandbox.xyz_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_dmarc.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.notification-sandbox-MX[0] must be replaced
-/+ resource "aws_route53_record" "notification-sandbox-MX" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_staging.notification.cdssandbox.xyz_MX" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.notification-sandbox-TXT[0] must be replaced
-/+ resource "aws_route53_record" "notification-sandbox-TXT" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z_staging.notification.cdssandbox.xyz_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.ses-notification-sandbox-TXT[0] must be replaced
-/+ resource "aws_route53_record" "ses-notification-sandbox-TXT" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "_amazonses.staging.notification.cdssandbox.xyz" -> (known after apply)
      ~ id                               = "Z04028033PLSHVOO9ZJ1Z__amazonses.staging.notification.cdssandbox.xyz_TXT" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_amazonses.staging.notification.cdssandbox.xyz"
      ~ zone_id                          = "/hostedzone/Z04028033PLSHVOO9ZJ1Z" -> "Z04028033PLSHVOO9ZJ1Z" # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 9 to destroy.

Changes to Outputs:
  + route53_zone_id                       = "Z04028033PLSHVOO9ZJ1Z"
  - staging_route_53_zone_arn             = "Z04028033PLSHVOO9ZJ1Z" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.dev_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.production_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sandbox_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.scratch_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.staging_dns_manager[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-sandbox[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
